In [1]:
import pandas as pd

**Задание 1**  
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [2]:
%%time

ratings = pd.read_csv('D:\\Temp\\MovieLens_dataset\\ratings.csv')    # Загрузка 25М файла
ratings.head()

Wall time: 5.77 s

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [10]:
movies = pd.read_csv('D:\\Temp\\MovieLens_dataset\\movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [126]:
# ratings[ratings['rating'] == 5]['movieId'].value_counts().head(1)    # Через value_counts() не пошло - не могу достать id
# аналогичная проблема возникла при группировке "как в SQL" (['movieId'] даёт KeyError), пришлось джойнить прямо так
# P.S. movieId хотел достать для того, чтобы не джойнить c таблицей movies, например

top_5_0_movie_id = ratings[ratings['rating'] == 5].groupby('movieId').count().sort_values('userId', ascending=False).head(1)
joined = top_5_0_movie_id.merge(movies, on='movieId', how='left')
joined[['movieId', 'title', 'rating']]

   movieId                             title  rating
0      318  Shawshank Redemption, The (1994)   39553

**Задание 2**  
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [131]:
power = pd.read_csv('power.csv')

baltic_power = power[(power['country'] == 'Latvia') | (power['country'] == 'Lithuania') | (power['country'] == 'Estonia')]
baltic_power_cat = baltic_power[ (baltic_power.category == 4) | (baltic_power.category == 12) | (baltic_power.category == 21)]
baltic_power_cat_2005_2010 = baltic_power_cat[ (2005 >= baltic_power_cat.year) & ( baltic_power_cat.year <= 2010) ]
# Смущают громоздкие условия. Наверняка можно компактнее, но времени не хватило, извините.

baltic_power_cat_2005_2010 [baltic_power_cat_2005_2010.quantity > 0 ]['quantity'].sum()

599697.0

**Задание 3**  
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):  
https://fortrader.org/quotes  
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [130]:
lang_rating = pd.read_html('https://www.tiobe.com/tiobe-index//', attrs = {'id': 'top20' })[0]
lang_rating.head()

   Jul 2020  Jul 2019  Change Programming Language Ratings Change.1
0         1         2     NaN                    C  16.45%   +2.24%
1         2         1     NaN                 Java  15.10%   +0.04%
2         3         3     NaN               Python   9.09%   -0.17%
3         4         4     NaN                  C++   6.21%   -0.49%
4         5         5     NaN                   C#   5.25%   +0.88%